In [94]:
print("Hello, World")

Hello, World

## Prepare Environment
**Install pandas library uisng the below command**  
The '!' tells Jupyter to run this as a command in your system's shell

In [95]:
!pip install pandas

Requirement already satisfied: pandas in ./createds/lib/python3.13/site-packages (2.3.1)
Requirement already satisfied: numpy>=1.26.0 in ./createds/lib/python3.13/site-packages (from pandas) (2.3.1)
Requirement already satisfied: python-dateutil>=2.8.2 in ./createds/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./createds/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in ./createds/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in ./createds/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [96]:
import pandas as pd
import json

## 1. Data Exploration
### Step 1: Load the CSV File into the DataFrame

In [97]:
df = pd.read_csv("data/mock_data.csv")

### Step 2: Analyse the Data

In [98]:
# Display the first 5 rows from the loaded DataFrame
df.head()

,id,name,age,salary,hire_date,profile,department,bonus
0,1,Name_103,77.0,60000.0,2024-09-07,"{""address"": ""Street 50, City 39"", ""phone"": ""87...",Marketing,4319.0
1,2,Name_436,62.0,50000.0,2021-09-09,"{""address"": ""Street 79, City 37"", ""phone"": ""82...",Marketing,4661.0
2,3,Name_861,61.0,60000.0,2018-08-12,"{""address"": ""Street 77, City 3"", ""phone"": ""984...",HR,1975.0
3,4,Name_271,36.0,70000.0,NaN,"{""address"": ""Street 91, City 19"", ""phone"": ""42...",NaN,4327.0
4,5,Name_107,78.0,60000.0,2022-01-30,"{""address"": ""Street 57, City 33"", ""phone"": ""74...",IT,NaN

In [99]:
# Get the summary of the DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          20000 non-null  int64
 1   name        20000 non-null  object
 2   age         19000 non-null  float64
 3   salary      13519 non-null  float64
 4   hire_date   17976 non-null  object
 5   profile     17904 non-null  object
 6   department  16003 non-null  object
 7   bonus       18070 non-null  float64
dtypes: float64(3), int64(1), object(4)
memory usage: 1.2+ MB

In [100]:
# Check unique values in the department column
df['department'].unique()

array(['Marketing', 'HR', nan, 'IT', 'Finance'], dtype=object)

In [101]:
# View statistical summary for numeric coloums
df.describe(include='all')

,id,name,age,salary,hire_date,profile,department,bonus
count,20000.000000,20000,19000.000000,13519.000000,17976,17904,16003,18070.000000
unique,NaN,999,NaN,NaN,3628,17904,4,NaN
top,NaN,Name_825,NaN,NaN,2017-09-09,"{""address"": ""Street 50, City 39"", ""phone"": ""87...",IT,NaN
freq,NaN,37,NaN,NaN,14,1,4058,NaN
mean,10000.500000,NaN,48.444684,59962.275316,NaN,NaN,NaN,5544.182070
std,5773.647028,NaN,17.892848,8200.588356,NaN,NaN,NaN,2588.256024
min,1.000000,NaN,18.000000,50000.000000,NaN,NaN,NaN,1000.000000
25%,5000.750000,NaN,33.000000,50000.000000,NaN,NaN,NaN,3305.000000
50%,10000.500000,NaN,48.000000,60000.000000,NaN,NaN,NaN,5573.000000
75%,15000.250000,NaN,64.000000,70000.000000,NaN,NaN,NaN,7777.500000
max,20000.000000,NaN,79.000000,70000.000000,NaN,NaN,NaN,10000.000000

In [102]:
# Check for missing values
df.isnull().sum()

id               0
name             0
age           1000
salary        6481
hire_date     2024
profile       2096
department    3997
bonus         1930
dtype: int64

## 2. Data Cleaning
### Step 1: Handle Missing values of age, and salary

In [103]:
print("Print the missing values in age, and salary\n")
print("Missing Age values")
print(df[df['age'].isnull()][['age', 'salary', 'department']])

Print the missing values in age, and salary

Missing Age values
       age   salary department
44     NaN  60000.0  Marketing
115    NaN  60000.0         IT
127    NaN      NaN  Marketing
147    NaN  60000.0         HR
164    NaN  70000.0         IT
...    ...      ...        ...
19872  NaN  60000.0         HR
19921  NaN      NaN         HR
19940  NaN  70000.0        NaN
19997  NaN  60000.0         IT
19998  NaN  60000.0  Marketing

[1000 rows x 3 columns]

In [104]:
print("Missing Salary values")
print(df[df['salary'].isnull()][['age', 'salary', 'department']])

Missing Salary values
        age  salary department
5      35.0     NaN         IT
11     61.0     NaN         IT
13     46.0     NaN        NaN
14     48.0     NaN         IT
15     61.0     NaN         HR
...     ...     ...        ...
19984  71.0     NaN        NaN
19988  72.0     NaN  Marketing
19992  60.0     NaN        NaN
19993  76.0     NaN  Marketing
19999  47.0     NaN        NaN

[6481 rows x 3 columns]

In [105]:
# Get the median values for age, and salary
age_median = df['age'].median()
salary_median = df['salary'].median()
print("Age Median", age_median)
print("Salary Median", salary_median)

Age Median 48.0
Salary Median 60000.0

In [106]:
# Fill missing values of age with age_median
df['age'] = df['age'].fillna(age_median)
# Fill missing values of salary with salary_median
df['salary'] = df['salary'].fillna(salary_median)

#### Age & Salary columns missing values are filled with the respective median

In [107]:
# Verify the Age & Salary data
df.head()
# Check for missing values
print("Missing values in each column")
df.isnull().sum()

Missing values in each column

id               0
name             0
age              0
salary           0
hire_date     2024
profile       2096
department    3997
bonus         1930
dtype: int64

### Step 2: Handle Missing values of Department

In [108]:
print("Print the missing values for Department\n")
print("Missing Department Missing values")
print(df[df['department'].isnull()][['age', 'salary', 'department']])

Print the missing values for Department

Missing Department Missing values
        age   salary department
3      36.0  70000.0        NaN
13     46.0  60000.0        NaN
49     34.0  50000.0        NaN
53     33.0  60000.0        NaN
57     28.0  70000.0        NaN
...     ...      ...        ...
19973  50.0  60000.0        NaN
19975  29.0  60000.0        NaN
19984  71.0  60000.0        NaN
19992  60.0  60000.0        NaN
19999  47.0  60000.0        NaN

[3997 rows x 3 columns]

In [109]:
# Fill the missing values in department with 'Unknown'
df['department'] = df['department'].fillna('Unknown')

#### Department column missing values are filled with the respective median

In [110]:
# Verify the Age & Salary data
df.head()
# Check for missing values
print("Missing values in each column")
print(df.isnull().sum())
# Check unique values in the department column
df['department'].unique()

Missing values in each column
id               0
name             0
age              0
salary           0
hire_date     2024
profile       2096
department       0
bonus         1930
dtype: int64

array(['Marketing', 'HR', 'Unknown', 'IT', 'Finance'], dtype=object)

### Step 3: Devide Profile Column into 3 different columns i.e., Address, Phone, Email

In [112]:
print("Top rows from profile column \n")
print(df['profile'].head())

# Find the first non-null value in the column
profile_first_value = df['profile'].dropna().iloc[0]
# Print its type
print("\nProfile column values current data type")
print(type(profile_first_value))

# If your 'profile' column already contains Python dictionaries, not JSON strings.
# You do not need to parse it with json.loads(). The data is ready to be used directly.

# Convert profile JSON strings into dictionaries
df['profile'] = df['profile'].apply(lambda x: json.loads(x) if pd.notnull(x) else {})

Top rows from profile column

0    {"address": "Street 50, City 39", "phone": "87...
1    {"address": "Street 79, City 37", "phone": "82...
2    {"address": "Street 77, City 3", "phone": "984...
3    {"address": "Street 91, City 19", "phone": "42...
4    {"address": "Street 57, City 33", "phone": "74...
Name: profile, dtype: object

Profile column values current data type
<class 'str'>

In [113]:
# Extract Address Field
print("Extract Address Field....\n")
# Create new 'address' column by extracting from 'profile' dictionaries
df['address'] = df['profile'].apply(lambda x: x.get('address', None))  # Returns None if no address key

print("Top rows from profile column \n")
print(df['profile'].head())
print("\nTop rows from newly created address column \n")
print(df['address'].head())

Extract Address Field....

Top rows from profile column

0    {'address': 'Street 50, City 39', 'phone': '87...
1    {'address': 'Street 79, City 37', 'phone': '82...
2    {'address': 'Street 77, City 3', 'phone': '984...
3    {'address': 'Street 91, City 19', 'phone': '42...
4    {'address': 'Street 57, City 33', 'phone': '74...
Name: profile, dtype: object

Top rows from newly created address column

0    Street 50, City 39
1    Street 79, City 37
2     Street 77, City 3
3    Street 91, City 19
4    Street 57, City 33
Name: address, dtype: object

In [114]:
# Extract Phone Field
print("Extract Phone Field....\n")
# Create new 'phone' column by extracting from 'profile' dictionaries
df['phone'] = df['profile'].apply(lambda x: x.get('phone', None))  # Returns None if no address key

print("Top rows from profile column \n")
print(df['profile'].head())
print("\nTop rows from newly created phone column \n")
print(df['phone'].head())

Extract Phone Field....

Top rows from profile column

0    {'address': 'Street 50, City 39', 'phone': '87...
1    {'address': 'Street 79, City 37', 'phone': '82...
2    {'address': 'Street 77, City 3', 'phone': '984...
3    {'address': 'Street 91, City 19', 'phone': '42...
4    {'address': 'Street 57, City 33', 'phone': '74...
Name: profile, dtype: object

Top rows from newly created phone column

0    8702681805
1    8212977467
2    9846890488
3    4217678676
4    7468823405
Name: phone, dtype: object

In [115]:
# Extract Email Field
print("Extract Email Field....\n")
# Create new 'email' column by extracting from 'profile' dictionaries
df['email'] = df['profile'].apply(lambda x: x.get('email', None))  # Returns None if no address key

print("Top rows from profile column \n")
print(df['profile'].head())
print("\nTop rows from newly created email column \n")
print(df['email'].head())

Extract Email Field....

Top rows from profile column

0    {'address': 'Street 50, City 39', 'phone': '87...
1    {'address': 'Street 79, City 37', 'phone': '82...
2    {'address': 'Street 77, City 3', 'phone': '984...
3    {'address': 'Street 91, City 19', 'phone': '42...
4    {'address': 'Street 57, City 33', 'phone': '74...
Name: profile, dtype: object

Top rows from newly created email column

0    email_742@example.com
1    email_486@example.com
2    email_727@example.com
3    email_338@example.com
4    email_665@example.com
Name: email, dtype: object

In [120]:
# Now drop the profile column
print("\nColumns before dropping profile:")
print(df.columns.tolist())

# Without inplace=True (df remains unchanged)
new_df = df.drop(columns=['profile'])

# With inplace=True (df is modified directly)
#df.drop(columns=['profile'], inplace=True)

print("\nColumns in new DataFrame after dropping profile:")
# print(df.columns.tolist())
print(new_df.columns.tolist())

Columns before dropping profile:
['id', 'name', 'age', 'salary', 'hire_date', 'profile', 'department', 'bonus', 'address', 'phone', 'email']

Columns in new DataFrame after dropping profile:
['id', 'name', 'age', 'salary', 'hire_date', 'department', 'bonus', 'address', 'phone', 'email']

### Step 4: Save cleaned data into new CSV

In [121]:
print("Saving cleaned data csv saved to: 'data/cleaned_data.csv' ...")
new_df.to_csv("data/cleaned_data.csv", index=False)
print("\nCleaned data csv saved to: 'data/cleaned_data.csv'")

Saving cleaned data csv saved to: 'data/cleaned_data.csv' ...

Cleaned data csv saved to: 'data/cleaned_data.csv'

## Data Transformation
### Step 1: Load the cleaned dataset into new DataFrame

In [124]:
clean_df = pd.read_csv("data/cleaned_data.csv")
clean_df.head()

,id,name,age,salary,hire_date,department,bonus,address,phone,email
0,1,Name_103,77.0,60000.0,2024-09-07,Marketing,4319.0,"Street 50, City 39",8.702682e+09,email_742@example.com
1,2,Name_436,62.0,50000.0,2021-09-09,Marketing,4661.0,"Street 79, City 37",8.212977e+09,email_486@example.com
2,3,Name_861,61.0,60000.0,2018-08-12,HR,1975.0,"Street 77, City 3",9.846890e+09,email_727@example.com
3,4,Name_271,36.0,70000.0,NaN,Unknown,4327.0,"Street 91, City 19",4.217679e+09,email_338@example.com
4,5,Name_107,78.0,60000.0,2022-01-30,IT,NaN,"Street 57, City 33",7.468823e+09,email_665@example.com

### Step2: Verify the Address Length

In [ ]:
# Create a new column 'address_length' 
clean_df['address_length'] = clean_df['address'].apply(lambda x: len(str(x))
print("Address followed by Address Length columns")